const data = {
  equipment: [
    {
      "название": "Автогидроподъёмник на базе шасси ГАЗ",
      "тип": "подъемник",
      "город": ["Минск", "Витебск"],
      "картинка": "../assets/rent1.png",
      "основная_характеристика": "Высота подъёма 18 м",
      "доп_характеристики": {
        "Аренда на смену": "200 руб",
        "Аренда на месяц": "2 000 руб",
        "Аренда от 3х месяцев": "от 5 000 руб"
      }
    },
    {
      "название": "Подъёмник ОПТ 9195 на базе трактора «Беларус»",
      "тип": "подъемник",
      "город": ["Минск"],
      "картинка": "../assets/rent2.png",
      "основная_характеристика": "Высота подъёма 7,8 м",
      "доп_характеристики": {
        "Аренда на смену": "200 руб",
        "Аренда на месяц": "2 000 руб",
        "Аренда от 3х месяцев": "от 5 000 руб"
      }
    },
    {
      "название": "Самосвал МАЗ",
      "тип": "самосвал",
      "город": ["Минск", "Гомель"],
      "картинка": "../assets/rent3.png",
      "основная_характеристика": "Грузоподъемность до 20т",
      "доп_характеристики": {
        "Аренда на смену": "200 руб",
        "Аренда на месяц": "2 000 руб",
        "Аренда от 3х месяцев": "от 5 000 руб"
      }
    },
    {
      "название": "Лебёдка кабельная",
      "тип": "лебедка",
      "город": ["Минск", "Брест", "Молодечно"],
      "картинка": "../assets/rent4.png",
      "основная_характеристика": "С тяговым усилием 5 т",
      "доп_характеристики": {
        "Аренда на смену": "200 руб",
        "Аренда на месяц": "2 000 руб",
        "Аренда от 3х месяцев": "от 5 000 руб"
      }
    },
    {
      "название": "Кран автомобильный стреловой",
      "тип": "кран",
      "город": ["Минск", "Могилев"],
      "картинка": "../assets/rent5.png",
      "основная_характеристика": "Грузоподъемность 16-25т",
      "доп_характеристики": {
        "Аренда на смену": "200 руб",
        "Аренда на месяц": "2 000 руб",
        "Аренда от 3х месяцев": "от 5 000 руб"
      }
    },
    {
      "название": "Лебёдка кабельная",
      "тип": "лебедка",
      "город": ["Гродно", "Витебск"],
      "картинка": "../assets/rent6.png",
      "основная_характеристика": "С тяговым усилителем 2т",
      "доп_характеристики": {
        "Аренда на смену": "200 руб",
        "Аренда на месяц": "2 000 руб",
        "Аренда от 3х месяцев": "от 5 000 руб"
      }
    },
    {
      "название": "Бурильно-крановая гидравлическая машин",
      "тип": "бурильно-крановая",
      "город": ["Минск", "Гомель"],
      "картинка": "../assets/rent7.png",
      "основная_характеристика": "На базе  автомобиля ГАЗ-66",
      "доп_характеристики": {
        "Аренда на смену": "200 руб",
        "Аренда на месяц": "2 000 руб",
        "Аренда от 3х месяцев": "от 5 000 руб"
      }
    },
    {
      "название": "Кран автомобильный стреловой",
      "тип": "кран",
      "город": ["Минск"],
      "картинка": "../assets/default.png",
      "основная_характеристика": "Грузоподъемность 32 т",
      "доп_характеристики": {
        "Аренда на смену": "200 руб",
        "Аренда на месяц": "2 000 руб",
        "Аренда от 3х месяцев": "от 5 000 руб"
      }
    },
    {
      "название": "Бурильно-крановая машина",
      "тип": "бурильно-крановая",
      "город": ["Минск"],
      "картинка": "../assets/default.png",
      "основная_характеристика": "бурильно-крановая",
      "доп_характеристики": {
        "Аренда на смену": "200 руб",
        "Аренда на месяц": "2 000 руб",
        "Аренда от 3х месяцев": "от 5 000 руб"
      }
    },
    {
      "название": "Экскаватор гусенечный",
      "тип": "экскаватор",
      "город": ["Гродно"],
      "картинка": "../assets/default.png",
      "основная_характеристика": "",
      "доп_характеристики": {
        "Аренда на смену": "200 руб",
        "Аренда на месяц": "2 000 руб",
        "Аренда от 3х месяцев": "от 5 000 руб"
      }
    },
    {
      "название": "Экскаваторы мобильные",
      "тип": "экскаватор",
      "город": ["Минск", "Витебск", "Гродно", "Гомель", "Могилев", "Брест", "Молодечно"],
      "картинка": "../assets/default.png",
      "основная_характеристика": "",
      "доп_характеристики": {
        "Аренда на смену": "200 руб",
        "Аренда на месяц": "2 000 руб",
        "Аренда от 3х месяцев": "от 5 000 руб"
      }
    },
    {
      "название": "Трактор «Беларус»",
      "тип": "трактор",
      "город": ["Минск", "Витебск", "Гродно", "Гомель", "Могилев", "Брест", "Молодечно"],
      "картинка": "../assets/default.png",
      "основная_характеристика": "Грузоподъемность 32 т",
      "доп_характеристики": {
        "Аренда на смену": "200 руб",
        "Аренда на месяц": "2 000 руб",
        "Аренда от 3х месяцев": "от 5 000 руб"
      }
    },
    {
      "название": "Бурильно-крановая машина",
      "тип": "бурильно-крановая",
      "город": ["Минск"],
      "картинка": "../assets/default.png",
      "основная_характеристика": "на базе автомобиля ГАЗ-33081",
      "доп_характеристики": {
        "Аренда на смену": "200 руб",
        "Аренда на месяц": "2 000 руб",
        "Аренда от 3х месяцев": "от 5 000 руб"
      }
    },
    {
      "название": "Экскаваторы с обратной лопатой",
      "тип": "экскаватор",
      "город": ["Минск"],
      "картинка": "../assets/default.png",
      "основная_характеристика": "",
      "доп_характеристики": {
        "Аренда на смену": "200 руб",
        "Аренда на месяц": "2 000 руб",
        "Аренда от 3х месяцев": "от 5 000 руб"
      }
    },
  ]
};

const typeFilter = document.getElementById("filter-type");
const cityFilter = document.getElementById("filter-city");
const list = document.querySelector(".rent-catalog");

function populateFilters() {
  const types = new Set();
  const cities = new Set();

  data.equipment.forEach(item => {
    types.add(item.тип);
    item.город.forEach(city => cities.add(city));
  });

  types.forEach(type => {
    const opt = document.createElement("option");
    opt.value = type;
    opt.textContent = type;
    typeFilter.appendChild(opt);
  });

  cities.forEach(city => {
    const opt = document.createElement("option");
    opt.value = city;
    opt.textContent = city;
    cityFilter.appendChild(opt);
  });
}


function renderEquipment(filtered) {
  list.innerHTML = "";


  if (filtered.length === 0) {
    const text = document.createElement("h5");
    text.className = "no-result";
    text.textContent = "Ничего не найдено. Попробуйте изменить фильтры."
    list.appendChild(text);
  }

  filtered.forEach(item => {
    const card = document.createElement("div");
    card.className = "rent-card";
    const image = document.createElement("img");
    image.className = "rent-card-image";
    image.src = item.картинка;
    const cardInfo = document.createElement("div");
    cardInfo.className = "rent-card-info";
    cardInfo.innerHTML = `
      <h6 class="rent-card-title">${item.название}</h6>
      <h7 class="rent-card-caption">${item.основная_характеристика}</h7>
      <ul class="price-list">
        <li class="price-item">
          <span class="price-item-text">Аренда на смену</span>
          <span class="dots"></span>
          <span class="value">${item.доп_характеристики["Аренда на смену"]}</span>
        </li>
        <li class="price-item">
          <span class="price-item-text">Аренда на месяц</span>
          <span class="dots"></span>
          <span class="value">${item.доп_характеристики["Аренда на месяц"]}</span>
        </li>
        <li class="price-item">
          <span class="price-item-text">Аренда от 3х месяцев</span>
          <span class="dots"></span>
          <span class="value">${item.доп_характеристики["Аренда от 3х месяцев"]}</span>
        </li>
      </ul>`;
    card.appendChild(image);
    card.appendChild(cardInfo);
    list.appendChild(card);
  });
}

function applyFilters() {
  const type = typeFilter.value;
  const city = cityFilter.value;

  const filtered = data.equipment.filter(item => {
    const typeMatch = !type || item.тип === type;
    const cityMatch = !city || item.город.includes(city);
    return typeMatch && cityMatch;
  });

  renderEquipment(filtered);
}

populateFilters();
renderEquipment(data.equipment);

typeFilter.addEventListener("change", applyFilters);
cityFilter.addEventListener("change", applyFilters);
